In [1]:
# This is a test block
print('Test')

Test

In [2]:
# import statements
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
   'A': ['alpha', 'apple', 'arsenic', 'angel', 'android'],
   'B': [1, 2, 3, 4, 5],
   'C': ['coconut', 'curse', 'cassava', 'cuckoo', 'clarinet'],
   'D': [6, 7, 8, 9, 10]
   },
   index=['row_0', 'row_1', 'row_2', 'row_3', 'row_4'])
df

             A  B         C   D
row_0    alpha  1   coconut   6
row_1    apple  2     curse   7
row_2  arsenic  3   cassava   8
row_3    angel  4    cuckoo   9
row_4  android  5  clarinet  10

In [4]:
df.loc[['row_1']]

           A  B      C  D
row_1  apple  2  curse  7

In [5]:
df.loc[['row_2', 'row_4']]

             A  B         C   D
row_2  arsenic  3   cassava   8
row_4  android  5  clarinet  10

In [6]:
df.iloc[[2, 4]]

             A  B         C   D
row_2  arsenic  3   cassava   8
row_4  android  5  clarinet  10

In [7]:
df[['C']]

              C
row_0   coconut
row_1     curse
row_2   cassava
row_3    cuckoo
row_4  clarinet

In [8]:
# Dot notation
df.C

row_0     coconut
row_1       curse
row_2     cassava
row_3      cuckoo
row_4    clarinet
Name: C, dtype: object

In [9]:
# loc[] notation
df.loc[:, ['C', 'D']]

              C   D
row_0   coconut   6
row_1     curse   7
row_2   cassava   8
row_3    cuckoo   9
row_4  clarinet  10

In [10]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars',
                   'Jupiter', 'Saturn', 'Uranus', 'Neptune'],
       'radius_km': [2440, 6052, 6371, 3390, 69911, 58232,
                     25362, 24622],
       'moons': [0, 0, 1, 2, 80, 83, 27, 14]
        }
df = pd.DataFrame(data)
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [11]:
print(df['moons'] < 20)

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: moons, dtype: bool

In [12]:
print(df[df['moons'] < 20])

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [13]:
mask = df['moons'] < 20
df[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [14]:
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [15]:
# The results of the comparison can be assigned to a new variable
mask = df['moons'] < 20
df2 = df[mask]
df2

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [16]:
# with this assignment we can now modify the new DataFrame for example selecting just the planet
#df2[['planet']]
mask = df['moons'] < 20
df.loc[mask, ['planet']]

    planet
0  Mercury
1    Venus
2    Earth
3     Mars
7  Neptune

In [17]:
mask = (df['moons'] < 10) | (df['moons'] > 50)
df[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83

In [18]:
mask = (df['moons'] > 20) & ~(df['moons'] == 80) & ~(df['radius_km'] < 50000)
df[mask]

   planet  radius_km  moons
5  Saturn      58232     83

In [19]:
clothes = pd.DataFrame({'type': ['pants', 'shirt', 'shirt', 'pants', 'shirt', 'pants'],
                       'color': ['red', 'blue', 'green', 'blue', 'green', 'red'],
                       'price_usd': [20, 35, 50, 40, 100, 75],
                       'mass_g': [125, 440, 680, 200, 395, 485]})


clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

In [20]:
# grouping the dataframe by 'type' results in a DataFrameGroupBy object
grouped = clothes.groupby('type')
print(grouped)
print(type(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E32C32A580>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [21]:
grouped = clothes.groupby('type')
grouped.mean(numeric_only = True)

       price_usd  mass_g
type
pants  45.000000   270.0
shirt  61.666667   505.0

In [22]:
# However, an aggregation function can be applied to grouped to obtain a DataFrame
clothes.groupby(['type', 'color']).mean()

             price_usd  mass_g
type  color
pants blue        40.0   200.0
      red         47.5   305.0
shirt blue        35.0   440.0
      green       75.0   537.5

In [23]:
clothes.groupby(['type', 'color']).min()

             price_usd  mass_g
type  color
pants blue          40     200
      red           20     125
shirt blue          35     440
      green         50     395

In [24]:
clothes.groupby(['type', 'color']).size()

type   color
pants  blue     1
       red      2
shirt  blue     1
       green    2
dtype: int64

In [25]:
clothes.describe()

        price_usd      mass_g
count    6.000000    6.000000
mean    53.333333  387.500000
std     29.268869  200.966415
min     20.000000  125.000000
25%     36.250000  248.750000
50%     45.000000  417.500000
75%     68.750000  473.750000
max    100.000000  680.000000

In [26]:
clothes[['price_usd', 'mass_g']].agg(['sum', 'mean', 'min', 'max'])

       price_usd  mass_g
sum   320.000000  2325.0
mean   53.333333   387.5
min    20.000000   125.0
max   100.000000   680.0

In [27]:
clothes.agg({'price_usd': 'sum',
            'mass_g': ['mean', 'median']
            })

        price_usd  mass_g
sum         320.0     NaN
mean          NaN   387.5
median        NaN   417.5

In [28]:
clothes[['price_usd', 'mass_g']].agg(['sum', 'mean'], axis=1)

     sum   mean
0  145.0   72.5
1  475.0  237.5
2  730.0  365.0
3  240.0  120.0
4  495.0  247.5
5  560.0  280.0

In [29]:
clothes.groupby('color').agg({'price_usd': ['mean', 'max'],
                             'mass_g': ['mean', 'max']})

      price_usd      mass_g
           mean  max   mean  max
color
blue       37.5   40  320.0  440
green      75.0  100  537.5  680
red        47.5   75  305.0  485